In [2]:
import pandas as pd
import numpy as np
import os
os.chdir('/Users/sarwaridas/Desktop/IDS 702/Final Project/ids720_CoffeeAndCrimes/')
coffee=pd.read_csv("02_processed_data/coffee_by_year_CCA.csv")
crime=pd.read_csv("02_processed_data/crime_by_year_CCA.csv")

In [3]:
coffee.head()

   Unnamed: 0          CCA    year  keep_row
0           0  Albany Park  2001.0         2
1           1  Albany Park  2002.0        22
2           2  Albany Park  2003.0        28
3           3  Albany Park  2004.0        32
4           4  Albany Park  2005.0        34

In [4]:
lookup= pd.read_csv(os.getcwd()+"/02_processed_data/location_lookup.csv")
lookup= dict(zip(lookup.CCA, lookup.name))

In [5]:
crime['CCA_name']=crime["Community Area"].map(lookup)
crime['CCA_name']=crime['CCA_name'].apply(lambda x: x.title())

In [6]:
crime=crime.drop(['Unnamed: 0' ,'Date','Primary Type', 'Description', 'Location Description', 'District','Ward','Location'],axis=1)
crime=crime.rename(columns={'ID':'crimes'})

crime.head()

   Year  Community Area  crimes        CCA_name
0  2002             1.0     278     Rogers Park
1  2002             2.0     144      West Ridge
2  2002             3.0     202          Uptown
3  2002             4.0      63  Lincoln Square
4  2002             5.0      72    North Center

In [7]:
crime.shape

(1539, 4)

In [8]:
crime.isna().sum()

Year              0
Community Area    0
crimes            0
CCA_name          0
dtype: int64

In [9]:
coffee=coffee.rename(columns={'keep_row':'coffeeshops'})
coffee=coffee.drop(['Unnamed: 0'],axis=1)
coffee.head()

           CCA    year  coffeeshops
0  Albany Park  2001.0            2
1  Albany Park  2002.0           22
2  Albany Park  2003.0           28
3  Albany Park  2004.0           32
4  Albany Park  2005.0           34

In [10]:
def category(x):
    if x <= 2009:
        return '2005-2009'
    elif x <= 2014: #& x>= 2010:
        return '2010-2014'
    elif x <= 2019:# & x>= 2015:
        return '2015-2019'
    elif x== 2020:
        return '2020'

crime=crime.loc[crime.Year>=2005]
crime=crime.loc[crime.Year<2021]

coffee=coffee.loc[coffee.year>=2005]
coffee=coffee.loc[coffee.year<2021]

crime.Year=crime.Year.astype(int)
coffee.year=coffee.year.astype(int)

crime['timeperiod']=crime.Year.apply(lambda x: category(x))
coffee['timeperiod']=coffee.year.apply(lambda x: category(x))
crime.head()

     Year  Community Area  crimes        CCA_name timeperiod
231  2005             1.0     306     Rogers Park  2005-2009
232  2005             2.0     194      West Ridge  2005-2009
233  2005             3.0     227          Uptown  2005-2009
234  2005             4.0      85  Lincoln Square  2005-2009
235  2005             5.0      51    North Center  2005-2009

In [11]:
coffee.year.unique()

array([2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015,
       2016, 2017, 2018, 2019, 2020])

In [12]:
crime.head()

     Year  Community Area  crimes        CCA_name timeperiod
231  2005             1.0     306     Rogers Park  2005-2009
232  2005             2.0     194      West Ridge  2005-2009
233  2005             3.0     227          Uptown  2005-2009
234  2005             4.0      85  Lincoln Square  2005-2009
235  2005             5.0      51    North Center  2005-2009

In [13]:
coffee.head()

           CCA  year  coffeeshops timeperiod
4  Albany Park  2005           34  2005-2009
5  Albany Park  2006           39  2005-2009
6  Albany Park  2007           38  2005-2009
7  Albany Park  2008           11  2005-2009
8  Albany Park  2009           35  2005-2009

In [14]:
# new_index = pd.MultiIndex.from_product(df.index.levels)
# new_df = df.reindex(new_index)

In [15]:
df_full=crime.merge(coffee, how='outer', left_on=["Year",'CCA_name'], right_on=["year","CCA"])
df_full.head()

,Year,Community Area,crimes,CCA_name,timeperiod_x,CCA,year,coffeeshops,timeperiod_y
0,2005.0,1.0,306.0,Rogers Park,2005-2009,Rogers Park,2005.0,12.0,2005-2009
1,2005.0,2.0,194.0,West Ridge,2005-2009,West Ridge,2005.0,26.0,2005-2009
2,2005.0,3.0,227.0,Uptown,2005-2009,Uptown,2005.0,19.0,2005-2009
3,2005.0,4.0,85.0,Lincoln Square,2005-2009,Lincoln Square,2005.0,48.0,2005-2009
4,2005.0,5.0,51.0,North Center,2005-2009,North Center,2005.0,18.0,2005-2009

In [16]:
df_full.sample(10)

,Year,Community Area,crimes,CCA_name,timeperiod_x,CCA,year,coffeeshops,timeperiod_y
792,2015.0,24.0,239.0,West Town,2015-2019,West Town,2015.0,33.0,2015-2019
365,2009.0,58.0,128.0,Brighton Park,2005-2009,Brighton Park,2009.0,1.0,2005-2009
476,2011.0,16.0,149.0,Irving Park,2010-2014,NaN,NaN,NaN,NaN
24,2005.0,25.0,1131.0,Austin,2005-2009,Austin,2005.0,2.0,2005-2009
1086,2019.0,10.0,8.0,Norwood Park,2015-2019,Norwood Park,2019.0,4.0,2015-2019
690,2013.0,76.0,8.0,O'Hare,2010-2014,NaN,NaN,NaN,NaN
579,2012.0,42.0,240.0,Woodlawn,2010-2014,NaN,NaN,NaN,NaN
696,2014.0,5.0,24.0,North Center,2010-2014,North Center,2014.0,9.0,2010-2014
1127,2019.0,51.0,48.0,South Deering,2015-2019,NaN,NaN,NaN,NaN
191,2007.0,38.0,258.0,Grand Boulevard,2005-2009,NaN,NaN,NaN,NaN

In [17]:
df_full.isna().sum()/len(df_full)

Year              0.000812
Community Area    0.000812
crimes            0.000812
CCA_name          0.000812
timeperiod_x      0.000812
CCA               0.366883
year              0.366883
coffeeshops       0.366883
timeperiod_y      0.366883
dtype: float64

In [22]:
df_full.to_csv(os.getcwd()+"/02_processed_data/coffee_crime.csv")